In [2]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.5.3'

In [3]:
import numpy as np
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
      'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
      'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
      'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

columns  你写几个就会有几个列,
index ,     前面索引的值

In [40]:
df1=pd.DataFrame(data,index=labels,columns=['name','age','visits'])

In [41]:
df1

  name  age visits
a  NaN  NaN    NaN
b  NaN  NaN    NaN
c  NaN  NaN    NaN
d  NaN  NaN    NaN
e  NaN  NaN    NaN
f  NaN  NaN    NaN
g  NaN  NaN    NaN
h  NaN  NaN    NaN
i  NaN  NaN    NaN
j  NaN  NaN    NaN

In [12]:
df=pd.DataFrame(data,index=labels,columns=['name','age'])

In [13]:
df

  name  age
a  NaN  2.5
b  NaN  3.0
c  NaN  0.5
d  NaN  NaN
e  NaN  5.0
f  NaN  2.0
g  NaN  4.5
h  NaN  NaN
i  NaN  7.0
j  NaN  3.0

describe   包含数字的会统计  数量，平均值，最小值  最大值，

In [42]:
df1.describe()

       name  age visits
count     0    0      0
unique    0    0      0
top     NaN  NaN    NaN
freq    NaN  NaN    NaN

In [18]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
df=pd.DataFrame(data)
df

   calories  duration
0       420        50
1       380        40
2       390        45

loc
 前一个变量 根据行的索引来读取某一行
 第二个变量是根据columns的名称来选取所在列

In [35]:
df.loc[ :,'calories']

0    420
1    380
2    390
Name: calories, dtype: int64

In [29]:
df.loc[0,:]

calories    420
duration     50
Name: 0, dtype: int64

In [19]:
df.loc[0]

calories    420
duration     50
Name: 0, dtype: int64

第一行， 第calories列对应的值

In [37]:
df.loc[1,'calories']

380

In [38]:
df.loc[1:3,'calories']

1    380
2    390
Name: calories, dtype: int64

In [43]:
df1[df1.age>1]

Empty DataFrame
Columns: [name, age, visits]
Index: []

In [44]:

 
# 生成DataFrame
data = pd.DataFrame(np.arange(30).reshape((6,5)),
                    columns=['A','B','C','D','E'])

In [45]:
data

    A   B   C   D   E
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29

In [46]:
data[data.B>6]

    A   B   C   D   E
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29

In [48]:
data.loc[1:,]

    A   B   C   D   E
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29

In [51]:
data.iloc[1:,]

    A   B   C   D   E
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29

In [53]:
data.iloc[:,1]

0     1
1     6
2    11
3    16
4    21
5    26
Name: B, dtype: int32

In [56]:
data.loc[1]

A    5
B    6
C    7
D    8
E    9
Name: 1, dtype: int32

In [57]:
import numpy as np
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
      'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
      'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
      'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data=data, index=labels)

In [58]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [60]:
df.loc[:,['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [61]:
df['visits'].sum()

19

In [63]:
df.groupby('animal')['age'].mean()

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

In [65]:
df.groupby('animal')['age'].mean()

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

In [67]:
df.groupby('animal')['visits'].mean()

animal
cat      2.0
dog      2.0
snake    1.5
Name: visits, dtype: float64

In [69]:
df['animal'].value_counts()

cat      4
dog      4
snake    2
Name: animal, dtype: int64

In [70]:
df.groupby('animal').size()

animal
cat      4
dog      4
snake    2
dtype: int64

map   批量替换

In [71]:
df['priority']=df['priority'].map({'yes':'true','no':'false'})

In [72]:
df

  animal  age  visits priority
a    cat  2.5       1     true
b    cat  3.0       3     true
c  snake  0.5       2    false
d    dog  NaN       3     true
e    dog  5.0       2    false
f    cat  2.0       3    false
g  snake  4.5       1    false
h    cat  NaN       1     true
i    dog  7.0       2    false
j    dog  3.0       1    false

replace  替换  to_replace  要替换的值  ， value  替换成什么

In [73]:
df['animal']=df['animal'].replace(to_replace='snake',value='python')
df

   animal  age  visits priority
a     cat  2.5       1     true
b     cat  3.0       3     true
c  python  0.5       2    false
d     dog  NaN       3     true
e     dog  5.0       2    false
f     cat  2.0       3    false
g  python  4.5       1    false
h     cat  NaN       1     true
i     dog  7.0       2    false
j     dog  3.0       1    false

数据透视表 pivot  table

In [74]:
df.pivot_table(index='animal',columns='visits',values='age',aggfunc='mean')

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN
python  4.5  0.5  NaN

In [75]:
arr=[4,5,7,8,10]
s1=pd.Series(arr)
s1

0     4
1     5
2     7
3     8
4    10
dtype: int64

In [80]:
n=np.random.rand(5)
n

array([0.08437481, 0.52305793, 0.52690188, 0.56285108, 0.35216226])

In [81]:
index=['a','b','c','d','e']
s2=pd.Series(n,index)

In [82]:
s2

a    0.084375
b    0.523058
c    0.526902
d    0.562851
e    0.352162
dtype: float64

In [87]:
df.head()

   animal  age  visits priority
a     cat  2.5       1     true
b     cat  3.0       3     true
c  python  0.5       2    false
d     dog  NaN       3     true
e     dog  5.0       2    false

by	指定列名(axis=0或’index’)或索引值(axis=1或’columns’)
axis	若axis=0或’index’，则按照指定列中数据大小排序；若axis=1或’columns’，则按照指定索引中数据大小排序，默认axis=0
ascending	是否按指定列的数组升序排列，默认为True，即升序排列
inplace	是否用排序后的数据集替换原来的数据，默认为False，即不替换
na_position	{‘first’,‘last’}，设定缺失值的显示位置

In [97]:
df.sort_values(by='age',ascending=False,na_position='first')

   animal  age  visits priority
d     dog  NaN       3     true
h     cat  NaN       1     true
i     dog  7.0       2    false
e     dog  5.0       2    false
g  python  4.5       1    false
b     cat  3.0       3     true
j     dog  3.0       1    false
a     cat  2.5       1     true
f     cat  2.0       3    false
c  python  0.5       2    false

In [98]:
df.mean()

C:\Users\21439\AppData\Local\Temp\ipykernel_10028\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

age       3.4375
visits    1.9000
dtype: float64

In [99]:
df.to_csv('test.csv')

In [2]:
pd.to_datetime('2023/4/12')

Timestamp('2023-04-12 00:00:00')

In [3]:
data=pd.read_csv('test.csv')

In [5]:
data.resample;

In [17]:
pd.date_range('2023-11-17',periods=5,freq='W')

DatetimeIndex(['2023-11-19', '2023-11-26', '2023-12-03', '2023-12-10',
               '2023-12-17'],
              dtype='datetime64[ns]', freq='W-SUN')

In [3]:
df=pd.read_csv('./数据分析(1).csv')

In [5]:
pd.date_range('2023-01-01',freq='W',periods=55)

DatetimeIndex(['2023-01-01', '2023-01-08', '2023-01-15', '2023-01-22',
               '2023-01-29', '2023-02-05', '2023-02-12', '2023-02-19',
               '2023-02-26', '2023-03-05', '2023-03-12', '2023-03-19',
               '2023-03-26', '2023-04-02', '2023-04-09', '2023-04-16',
               '2023-04-23', '2023-04-30', '2023-05-07', '2023-05-14',
               '2023-05-21', '2023-05-28', '2023-06-04', '2023-06-11',
               '2023-06-18', '2023-06-25', '2023-07-02', '2023-07-09',
               '2023-07-16', '2023-07-23', '2023-07-30', '2023-08-06',
               '2023-08-13', '2023-08-20', '2023-08-27', '2023-09-03',
               '2023-09-10', '2023-09-17', '2023-09-24', '2023-10-01',
               '2023-10-08', '2023-10-15', '2023-10-22', '2023-10-29',
               '2023-11-05', '2023-11-12', '2023-11-19', '2023-11-26',
               '2023-12-03', '2023-12-10', '2023-12-17', '2023-12-24',
               '2023-12-31', '2024-01-07', '2024-01-14'],
              dtype='datetime64[ns]', freq='W-SUN')

内连接：  将两个表符合要求 的 结合在一起
外连接     将两个表所有的消息合并   空缺的用null填充
左连接    将左表的所有信息全部保存  合并右表中符合条件的。

In [14]:
import numpy as np

In [15]:

data = {"grammer":['Python', 'C', 'Java', 'GO', np.NaN, 'SQL', 'PHP', 'Python'],
       "score":[1.0, 2.0, np.NaN, 4.0, 5.0, 6.0, 7.0, 10.0]}

In [16]:
df=pd.DataFrame(data)

In [17]:
df

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    NaN
3      GO    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0
7  Python   10.0

In [20]:
df[df['grammer']=='Python']

  grammer  score
0  Python    1.0
7  Python   10.0

In [21]:
df.columns

Index(['grammer', 'score'], dtype='object')

## 4.修改第二列列名为'popularity'

In [22]:
df.rename(columns={'score':'popolularity'},inplace=True)

In [23]:
df.columns

Index(['grammer', 'popolularity'], dtype='object')

In [24]:
df.groupby('grammer').count()

         popolularity
grammer
C                   1
GO                  1
Java                0
PHP                 1
Python              2
SQL                 1

In [26]:
df['grammer'].value_counts()

Python    2
C         1
Java      1
GO        1
SQL       1
PHP       1
Name: grammer, dtype: int64

## 6.将空值用上下值的平均值填充

In [33]:
df['popolularity']=df['popolularity'].fillna(df['popolularity'].interpolate())
df

  grammer  popolularity
0  Python           1.0
1       C           2.0
2    Java           3.0
3      GO           4.0
4     NaN           5.0
5     SQL           6.0
6     PHP           7.0
7  Python          10.0

In [34]:
df[df['popolularity']>=3]

  grammer  popolularity
2    Java           3.0
3      GO           4.0
4     NaN           5.0
5     SQL           6.0
6     PHP           7.0
7  Python          10.0

In [35]:
df.drop_duplicates(['grammer'])

  grammer  popolularity
0  Python           1.0
1       C           2.0
2    Java           3.0
3      GO           4.0
4     NaN           5.0
5     SQL           6.0
6     PHP           7.0

In [36]:
df['popolularity'].mean()

4.75

In [39]:
data=list(df['grammer'])
data

['Python', 'C', 'Java', 'GO', nan, 'SQL', 'PHP', 'Python']

In [40]:
df['grammer'].to_list()

['Python', 'C', 'Java', 'GO', nan, 'SQL', 'PHP', 'Python']

In [42]:
df.to_csv('test1.csv')

In [43]:
df.shape

(8, 2)

In [46]:
df[(df['popolularity']>3)&(df['popolularity']<7)]

  grammer  popolularity
3      GO           4.0
4     NaN           5.0
5     SQL           6.0

14.交换两列位置

In [49]:
cols=df.columns[[1,0]]
df=df[cols]
df

   popolularity grammer
0           1.0  Python
1           2.0       C
2           3.0    Java
3           4.0      GO
4           5.0     NaN
5           6.0     SQL
6           7.0     PHP
7          10.0  Python

In [51]:
df[df['popolularity']==df['popolularity'].max()]

   popolularity grammer
7          10.0  Python

In [52]:
np.random.randint(0,100,20)

array([94, 85, 18, 30, 88, 40, 89, 61, 12, 61, 18, 91, 28, 48, 38, 85, 88,
       47,  4, 37])

In [54]:
len(np.arange(1,100,2))

50

In [3]:
data1={
   'Id': [202001, 202002, 202003, 202004, 202005, 202006, 202007, 202008, 202009, 202010] , 
'Chinese': [98, 67, 84, 88, 78, 90, 93, 75, 82, 87]  ,
'Math': [92, 80, 73, 76, 88, 78, 90, 82, 77, 69]  ,
'English': [88, 79, 90, 73, 79, 83, 81, 91, 71, 78]  
}

In [4]:
data=pd.DataFrame(data1)

In [5]:
data

       Id  Chinese  Math  English
0  202001       98    92       88
1  202002       67    80       79
2  202003       84    73       90
3  202004       88    76       73
4  202005       78    88       79
5  202006       90    78       83
6  202007       93    90       81
7  202008       75    82       91
8  202009       82    77       71
9  202010       87    69       78

计算出每位同学的总成绩(SumScore)、平均成绩(MeanScore)，最高成绩(MaxScore)、
最低成绩(MinScore)、最高成绩与最低成绩的极差(PtpScore)、

绩方差(VarScore)；并将所有数据保存到score数据框中；


将多列数据(包括学生的ID)合并到一列中，列名设置为answer，最终只保留索引id（从0到100）和answer两列，统一保留整数；

In [6]:
data['SumScore']=data[['Chinese','Math','English']].sum(axis=1)

In [7]:
data['MeanScore']=data[['Chinese','Math','English']].mean(axis=1)

In [8]:
data['MaxScore']=data[['Chinese','Math','English']].max(axis=1)
data['MinScore']=data[['Chinese','Math','English']].min(axis=1)

In [9]:
data

       Id  Chinese  Math  English  SumScore  MeanScore  MaxScore  MinScore
0  202001       98    92       88       278  92.666667        98        88
1  202002       67    80       79       226  75.333333        80        67
2  202003       84    73       90       247  82.333333        90        73
3  202004       88    76       73       237  79.000000        88        73
4  202005       78    88       79       245  81.666667        88        78
5  202006       90    78       83       251  83.666667        90        78
6  202007       93    90       81       264  88.000000        93        81
7  202008       75    82       91       248  82.666667        91        75
8  202009       82    77       71       230  76.666667        82        71
9  202010       87    69       78       234  78.000000        87        69

In [10]:
data['test']=data['Chinese'].rank(ascending=False)

In [11]:
data.sort_values(by='test')

,Id,Chinese,Math,English,SumScore,MeanScore,MaxScore,MinScore,test
0,202001,98,92,88,278,92.666667,98,88,1.0
6,202007,93,90,81,264,88.000000,93,81,2.0
5,202006,90,78,83,251,83.666667,90,78,3.0
3,202004,88,76,73,237,79.000000,88,73,4.0
9,202010,87,69,78,234,78.000000,87,69,5.0
2,202003,84,73,90,247,82.333333,90,73,6.0
8,202009,82,77,71,230,76.666667,82,71,7.0
4,202005,78,88,79,245,81.666667,88,78,8.0
7,202008,75,82,91,248,82.666667,91,75,9.0
1,202002,67,80,79,226,75.333333,80,67,10.0

In [12]:
data

,Id,Chinese,Math,English,SumScore,MeanScore,MaxScore,MinScore,test
0,202001,98,92,88,278,92.666667,98,88,1.0
1,202002,67,80,79,226,75.333333,80,67,10.0
2,202003,84,73,90,247,82.333333,90,73,6.0
3,202004,88,76,73,237,79.000000,88,73,4.0
4,202005,78,88,79,245,81.666667,88,78,8.0
5,202006,90,78,83,251,83.666667,90,78,3.0
6,202007,93,90,81,264,88.000000,93,81,2.0
7,202008,75,82,91,248,82.666667,91,75,9.0
8,202009,82,77,71,230,76.666667,82,71,7.0
9,202010,87,69,78,234,78.000000,87,69,5.0

In [22]:
type(data.loc[:,['Id']])

pandas.core.frame.DataFrame

In [23]:
data.index

RangeIndex(start=0, stop=10, step=1)

In [24]:
data.columns

Index(['Id', 'Chinese', 'Math', 'English', 'SumScore', 'MeanScore', 'MaxScore',
       'MinScore', 'test'],
      dtype='object')

In [27]:
data.loc[0:5,'Math']

0    92
1    80
2    73
3    76
4    88
5    78
Name: Math, dtype: int64

In [30]:
test=lambda x:x*83
test(1)

83